routes/web.php

select * from `products` order by `created_at` desc limit 8
select * from `products` where `type` = 'mouse' order by `created_at` desc limit 4
---
Route::get('/', function () { // ts for landing pages
    $categories = ['mouse', 'keyboard', 'cpu', 'gpu', 'monitor'];

    return DatabaseAvailability::fallback(function () use ($categories) {
        $featuredProducts = Product::with('reviews')
            ->orderBy('created_at', 'desc')
            ->take(8)
            ->get();

        $productsByCategory = [];
        foreach ($categories as $cat) {
            $productsByCategory[$cat] = Product::where('type', $cat)
                ->orderBy('created_at', 'desc')
                ->take(4)
                ->get();
        }

        return view('pages.Landing', compact('featuredProducts', 'categories', 'productsByCategory'));
    }, function () use ($categories) {
        $productsByCategory = collect($categories)
            ->mapWithKeys(fn ($category) => [$category => collect()])
            ->all();

        return view('pages.Landing', [

select `products`.*, (select avg(`reviews`.`rating`) from `reviews` where `products`.`id` = `reviews`.`product_id`) as `reviews_avg_rating` from `products` order by `reviews_avg_rating` desc limit 4
select * from `website_reviews` order by `created_at` desc limit 3
---
Route::view('/contact', 'pages.Contact')->name('contact');

//About us
Route::get('/about-us', function () {
    return DatabaseAvailability::fallback(function () {
        $topRatedProducts = \App\Models\Product::withAvg('reviews', 'rating')
            ->orderBy('reviews_avg_rating', 'desc')
            ->take(4)
            ->get();

        $websiteReviews = \App\Models\WebsiteReview::latest()->take(3)->get();

        return view('pages.about_us', compact('topRatedProducts', 'websiteReviews'));
    }, fn () => view('pages.about_us', [
        'topRatedProducts' => collect(),
        'websiteReviews' => collect(),
        'databaseWarning' => DatabaseAvailability::warningMessage(),
    ]));
})->name('about');