app/Http/Controllers/ProductController.php

                $productsQuery->orderBy('created_at', 'desc');
            }

            return [
                'products' => $productsQuery->get(),
                'types' => Product::select('type')->distinct()->orderBy('type')->pluck('type'),
                'databaseWarning' => null,
            ];
---
select distinct `type` from `products` order by `type` asc